package pkg;

import java.util.Scanner;

public class Main {

	public static void main(String[] args) {
		/*
		 * 10월 2일(월) ~ 10월 8일(일) 회고록
		 * 
		 * SQLD 최종 합격 공지서가 나왔다~ 하하하
		 * 준비한 보람이 있는 것 같아 기분이 좋았다.
		 * 
		 * 이제 나는 무엇을 향해 다시 나아갈까? 고민을 해봤다.
		 * 나는 지금 알고리즘 문제 푸는 것 제외하고 딱히 크게 무엇을 하는 것 같진 않다.
		 * 하여 인프런에 강의를 하나 더 들을까 생각도 하고 있다.
		 * 지금은 JPA 강의를 신청했는데,
		 * 우리 회사는 JPA를 사용하지 않아서 우선순위를 조금 뒤에 두어야 할 것 같다.
		 * 
		 * 그렇다면 나는 스프링 부트를 좀 더 배우기 위해 공부를 해야 할까?
		 * 아니면 JavaScript가 조금 약하다고 생각하는데 이쪽을 강의를 더 들어야 할까?
		 * 고민하고 있다. 아니면 공통적인 SQL 공부를 할까 싶기도 하고...~
		 * 
		 * 예전의 나였으면 '둘 다 하면 되지' 라고 생각했을 것이다.
		 * 하지만 배우면 배울수록 하나라도 확실히 배워야겠다라고 생각했고,
		 * 어정쩡하게 아는 건 여기 세계에서는 통하지 않는 것 같다는 생각을 했다.
		 * 
		 * 다음 주 회고록 쓰기 전까지는 아마 정하겠지.
		 * 잘 생각해서 빠르게 나아가야겠다.
		 * 
		 * 오늘도 화이팅하자 최정원~!
		 *
		 * 
		 * 
		 */
	}

}
